# todo: Дан номер некоторого года (положительное целое число).
# Вывести соответствующий ему номер столетия, учитывая, что, к примеру, началом 20 столетия был 1901 год.
year = input('Введите столетие: ')
century = year[0:2]
# почему при конфигурации century = year[0:1] в выводе принта вижу только первое число
# пример : century = year[0:1]
#          print(century)
#          столетие 1
# ведь при индексации мы идем от 0 до ...последнего значения строки, соответственно 0 == 1, 1 == 2 и т.д.
print('столетие ', int(century) + 1)
